src/Catalogs/ПолисыМедицинскогоСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПолисыМедицинскогоСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитПолиса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГарантийногоПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммаПрикрепления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияПолиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПолиса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПолиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Comment>Документ оказания услуг, реализации товаров</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументАванса</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентПлательщик</Name>
					<Comment>Контрагент плательщик</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗуба</Name>
					<Comment>Номер зуба(лечение)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗубнойТехник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Catalogs/ПолисыМедицинскогоСтрахования/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция вернет массив мед. полисов контрагента активных на данные переданный период 
//
Функция ПолучитьАктивныеПолисыКонтрагента(Контрагент, Период = Неопределено, ТипПолиса = Неопределено, ПустаяДата = Истина, ВернутьРезультатЗапроса = Ложь) Экспорт
	
	ЗапросВыборка = Новый Запрос;
	ЗапросВыборка.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПолисыМедицинскогоСтрахования.Ссылка КАК Ссылка,
	|	ПолисыМедицинскогоСтрахования.Представление КАК Представление
	|ИЗ
	|	Справочник.ПолисыМедицинскогоСтрахования КАК ПолисыМедицинскогоСтрахования
	|ГДЕ
	|	ПолисыМедицинскогоСтрахования.Контрагент = &Контрагент
	|	И ПолисыМедицинскогоСтрахования.ПометкаУдаления = ЛОЖЬ
	|	И (ПолисыМедицинскогоСтрахования.ТипПолиса = &ТипПолиса
	|			ИЛИ &ТипПолиса = НЕОПРЕДЕЛЕНО)
	|	И ПолисыМедицинскогоСтрахования.ДанаНачала <= &Период
	|	И (ПолисыМедицинскогоСтрахования.ДатаОкончания >= &Период
	|			ИЛИ ПолисыМедицинскогоСтрахования.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|				И &ПустаяДата)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПолисыМедицинскогоСтрахования.ДатаОкончания УБЫВ";
	
	 ЗапросВыборка.УстановитьПараметр("Контрагент",Контрагент);
	 ЗапросВыборка.УстановитьПараметр("ТипПолиса" ,ТипПолиса);  
	 ЗапросВыборка.УстановитьПараметр("ПустаяДата",ПустаяДата);
	 ЗапросВыборка.УстановитьПараметр("Период"    ,?(ЗначениеЗаполнено(Период), НачалоДня(Период), НачалоДня(ТекущаяДата())));
	 
	 Если ВернутьРезультатЗапроса = Истина Тогда
		Возврат ЗапросВыборка.Выполнить().Выгрузить(); 	 
	 Иначе		 
		 Возврат ЗапросВыборка.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	 КонецЕсли; 
	 
КонецФункции

// Функция возвращает аббревиатуру типа полиса
//
Функция ПолучитьАббревиатуруТипаПолиса(ТипПолиса) Экспорт 
	
	ТипПолиса_Строка = Строка(ТипПолиса);
	Аббревиатура_ТипПолиса = Лев(ТипПолиса_Строка, 3);
	Возврат Аббревиатура_ТипПолиса;	
	
КонецФункции

// Функция, возвращает сумму оплат по полису.
//
Функция ПолучитьСуммуОплатыПоПолису(Полис, ДатаОкончания = Неопределено) Экспорт
	
	Если ДатаОкончания = Неопределено Тогда
		ДатаОкончания = ТекущаяДатаСеанса();
	КонецЕсли;                              
	
	Запрос = Новый Запрос;                  
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(СУММА(ВзаиморасчетыСКонтрагентамиОбороты.СуммаРасход), 0) КАК СуммаОплачено
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Обороты(, &ДатаОкончания, Авто, ВЫРАЗИТЬ(ДокументРеализации КАК Документ.Прием).ПолисМедСтрахования = &ПолисМедСтрахования) КАК ВзаиморасчетыСКонтрагентамиОбороты";
	Запрос.УстановитьПараметр("ПолисМедСтрахования", Полис);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаЗапроса.Следующий() Цикл
		Возврат ВыборкаЗапроса.СуммаОплачено;
	КонецЦикла;
	
КонецФункции

// Функция - Получить историю списания полиса.
//
Функция ПолучитьИсториюСписанияПолиса(Полис) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Период КАК Период,
	|	ПродажиОбороты.ДокументПродажи КАК Регистратор,
	|	ЕСТЬNULL(ПродажиОбороты.СтоимостьОборот, 0) КАК Сумма,
	|	ВЫРАЗИТЬ(ПродажиОбороты.ДокументПродажи КАК Документ.Прием).Представление КАК Операция
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(
	|			,
	|			&Дата,
	|			Регистратор,
	|			ДокументПродажи ССЫЛКА Документ.Прием
	|				И ВЫРАЗИТЬ(ДокументПродажи КАК Документ.Прием).ПолисМедСтрахования = &ПолисМедСтрахования) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	Запрос.УстановитьПараметр("ПолисМедСтрахования", Полис);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти
